FranciszekJanicki/devcontainer-stm32-cubemx-invertedsway/Core/Src/mpu6050.cpp
#include "mpu6050.hpp"
#include "common.hpp"
#include "main.h"
#include "stm32l4xx_hal.h"
#include "stm32l4xx_hal_i2c.h"
#include <cmath>
#include <cstddef>
#include <cstdint>
#include <cstdio>
#include <expected>

using namespace InvertedSway;
using Scaled = MPU6050::Scaled;
using GyroScaled = MPU6050::GyroScaled;
using AccelScaled = MPU6050::AccelScaled;
using RollPitchYaw = MPU6050::RollPitchYaw;
using TempScaled = MPU6050::TempScaled;
using Raw = MPU6050::Raw;
using GyroRaw = MPU6050::GyroRaw;
using AccelRaw = MPU6050::AccelRaw;
using TempRaw = MPU6050::TempRaw;

namespace InvertedSway {

    Scaled MPU6050::gyro_range_to_scale(GyroRange const gyro_range) noexcept
    {
        switch (gyro_range) {
            case GYRO_FS_250:
                return 131.0f;
            case GYRO_FS_500:
                return 65.5f;
            case GYRO_FS_1000:
                return 32.8f;
            case GYRO_FS_2000:
                return 16.4f;
            default:
                return 0.0f;
        }
    }

    Scaled MPU6050::accel_range_to_scale(AccelRange const accel_range) noexcept
    {
        switch (accel_range) {
            case ACCEL_FS_2:
                return 16384.0f;
            case ACCEL_FS_4:
                return 8192.0f;
            case ACCEL_FS_8:
                return 4096.0f;
            case ACCEL_FS_16:
                return 2048.0f;
            default:
                return 0.0f;
        }
    }

    MPU6050::MPU6050(I2cHandle i2c,
                     Address const address,
                     GyroRange const gyro_range,
                     AccelRange const accel_range,
                     std::uint32_t const sampling_rate) noexcept :
        i2c_{i2c}, address_{address}, gyro_range_{gyro_range}, accel_range_{accel_range}

    {
        this->initialize(sampling_rate);
    }

    MPU6050::~MPU6050() noexcept
    {
        this->deinitialize();
    }

    void MPU6050::initialize(std::uint32_t const sampling_rate) noexcept
    {
        if (!this->initialized_) {
            if (HAL_I2C_IsDeviceReady(this->i2c_, this->address_, 10, I2C_TIMEOUT) != HAL_OK) {
                printf("device is not ready\r\n");
                return;
            }

            this->set_address_pin(AD0_GPIO_Port, AD0_Pin);
            if (this->get_device_id() == this->address_) {
                this->device_reset();
                HAL_Delay(50);
                this->set_sleep_enabled(DISABLE);
                HAL_Delay(50);
                this->set_clock_source(CLOCK_INTERNAL);
                HAL_Delay(50);
                this->set_dlpf(DLPF_BW_256);
                HAL_Delay(50);
                this->set_sampling_divider(get_sampling_divider(sampling_rate, DLPF_BW_256));
                HAL_Delay(50);
                this->set_full_scale_gyro_range(this->gyro_range_);
                HAL_Delay(50);
                this->set_full_scale_accel_range(this->accel_range_);
                HAL_Delay(50);
                this->set_interrupt();
                this->initialized_ = true;
            }
        }
    }

    void MPU6050::deinitialize() noexcept
    {
        if (this->initialized_) {
            if (this->get_device_id() == this->address_) {
                this->device_reset();
                this->initialized_ = false;
            }
        }
    }

    void MPU6050::set_dlpf(DLPF const value) const noexcept
    {
        std::uint8_t buffer{value & 0x7};
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_CONFIG,
                          sizeof(RA_CONFIG),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_address_pin(GpioHandle gpio, std::uint16_t const address_pin) const noexcept
    {
        if (this->address_ == ADDRESS) {
            HAL_GPIO_WritePin(gpio, address_pin, GPIO_PinState::GPIO_PIN_RESET);
        } else if (this->address_ == ADDRESS2) {
            HAL_GPIO_WritePin(gpio, address_pin, GPIO_PinState::GPIO_PIN_SET);
        }
    }

    void MPU6050::device_reset() const noexcept
    {
        std::uint8_t buffer{1U << PWR1_DEVICE_RESET_BIT};
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_1,
                          sizeof(RA_PWR_MGMT_1),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    std::uint32_t MPU6050::get_sampling_divider(std::uint32_t const rate, DLPF const dlpf) noexcept
    {
        if (dlpf == DLPF_BW_256) {
            return (GYRO_OUTPUT_RATE_DLPF_DIS_HZ / rate) - 1U;
        } else {
            return (GYRO_OUTPUT_RATE_DLPF_EN_HZ / rate) - 1U;
        }
    }

    void MPU6050::set_sampling_divider(std::uint8_t const divider) const noexcept
    {
        std::uint8_t buffer{divider};
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_SMPLRT_DIV,
                          sizeof(RA_SMPLRT_DIV),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_sleep_enabled(Enable const enable) const noexcept
    {
        std::uint8_t buffer{(enable & 1U) << PWR1_SLEEP_BIT};
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_1,
                          sizeof(RA_PWR_MGMT_1),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_cycle_enabled(Enable const enable) const noexcept
    {
        std::uint8_t buffer{(enable & 1U) << PWR1_CYCLE_BIT};
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_1,
                          sizeof(RA_PWR_MGMT_1),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_temperature_sensor_enabled(Enable const enable) const noexcept
    {
        std::uint8_t buffer{(!enable & 1U) << PWR1_TEMP_DIS_BIT};
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_1,
                          sizeof(RA_PWR_MGMT_1),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_clock_source(Clock const source) const noexcept
    {
        std::uint8_t buffer{(source & 0x7)};
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_1,
                          sizeof(RA_PWR_MGMT_1),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_low_power_wake_up_frequency(WakeFreq const frequency) const noexcept
    {
        std::uint8_t buffer{(frequency & 0x3) << PWR2_LP_WAKE_CTRL_BIT};
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_2,
                          sizeof(RA_PWR_MGMT_2),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::accelerometer_axis_standby(std::uint8_t const x_accel_standby,
                                             std::uint8_t const y_accel_standby,
                                             std::uint8_t const z_accel_standby) const noexcept
    {
        std::uint8_t buffer{((x_accel_standby & 1U) << PWR2_STBY_XA_BIT) |
                            ((y_accel_standby & 1U) << PWR2_STBY_YA_BIT) |
                            ((z_accel_standby & 1U) << PWR2_STBY_ZA_BIT)};
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_2,
                          sizeof(RA_PWR_MGMT_2),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

