FranciszekJanicki/devcontainer-stm32-cubemx-invertedsway/Core/Src/mpu6050.cpp
        return ((static_cast<Raw>(buffer[0])) << 8) | buffer[1];
    }

    Raw MPU6050::get_rotation_y_raw() const noexcept
    {
        if (!this->initialized_) {
            std::unreachable();
        }

        std::uint8_t buffer[2];
        HAL_I2C_Mem_Read(this->i2c_,
                         this->address_,
                         RA_GYRO_YOUT_H,
                         sizeof(RA_GYRO_YOUT_H),
                         buffer,
                         sizeof(buffer),
                         I2C_TIMEOUT);

        return ((static_cast<Raw>(buffer[0])) << 8) | buffer[1];
    }

    Raw MPU6050::get_rotation_z_raw() const noexcept
    {
        if (!this->initialized_) {
            std::unreachable();
        }

        std::uint8_t buffer[2];
        HAL_I2C_Mem_Read(this->i2c_,
                         this->address_,
                         RA_GYRO_ZOUT_H,
                         sizeof(RA_GYRO_ZOUT_H),
                         buffer,
                         sizeof(buffer),
                         I2C_TIMEOUT);

        return ((static_cast<Raw>(buffer[0])) << 8) | buffer[1];
    }

    Scaled MPU6050::get_rotation_x_scaled() const noexcept
    {
        if (!this->initialized_) {
            std::unreachable();
        }

        return static_cast<Scaled>(this->get_rotation_x_raw()) / gyro_range_to_scale(this->gyro_range_);
    }

    Scaled MPU6050::get_rotation_y_scaled() const noexcept
    {
        if (!this->initialized_) {
            std::unreachable();
        }

        return static_cast<Scaled>(this->get_rotation_y_raw()) / gyro_range_to_scale(this->gyro_range_);
    }

    Scaled MPU6050::get_rotation_z_scaled() const noexcept
    {
        if (!this->initialized_) {
            std::unreachable();
        }

        return static_cast<Scaled>(this->get_rotation_x_raw()) * gyro_range_to_scale(this->gyro_range_);
    }

    GyroRaw MPU6050::get_gyroscope_raw() const noexcept
    {
        if (!this->initialized_) {
            std::unreachable();
        }

        std::uint8_t buffer[6];
        HAL_I2C_Mem_Read(this->i2c_,
                         this->address_,
                         RA_GYRO_XOUT_H,
                         sizeof(RA_GYRO_XOUT_H),
                         buffer,
                         sizeof(buffer),
                         I2C_TIMEOUT);

        return GyroRaw{((static_cast<Raw>(buffer[0])) << 8) | buffer[1],
                       ((static_cast<Raw>(buffer[2])) << 8) | buffer[3],
                       ((static_cast<Raw>(buffer[4])) << 8) | buffer[5]};
    }

    GyroScaled MPU6050::get_gyroscope_scaled() const noexcept
    {
        if (!this->initialized_) {
            std::unreachable();
        }

        const auto gyro_scale{gyro_range_to_scale(this->gyro_range_)};
        const auto gyro_raw{this->get_gyroscope_raw()};

        return GyroScaled{static_cast<Scaled>(gyro_raw.x) / gyro_scale,
                          static_cast<Scaled>(gyro_raw.y) / gyro_scale,
                          static_cast<Scaled>(gyro_raw.z) / gyro_scale};
    }

    RollPitchYaw MPU6050::get_roll_pitch_yaw() const noexcept
    {
        if (!this->initialized_) {
            std::unreachable();
        }

        const auto accel_scaled{get_accelerometer_scaled()};

        return RollPitchYaw{
            std::atan2(accel_scaled.y, accel_scaled.z) * 180.0 / M_PI,
            -(std::atan2(accel_scaled.x, std::sqrt(accel_scaled.y * accel_scaled.y + accel_scaled.z * accel_scaled.z)) *
              180.0) /
                M_PI,
            {}};
    }

    Scaled MPU6050::get_roll() const noexcept
    {
        if (!this->initialized_) {
            std::unreachable();
        }

        const auto accel_scaled{get_accelerometer_scaled()};

        return std::atan2(accel_scaled.y, accel_scaled.z) * 180.0 / M_PI;
    }

    Scaled MPU6050::get_pitch() const noexcept
    {
        if (!this->initialized_) {
            std::unreachable();
        }

        const auto accel_scaled{get_accelerometer_scaled()};

        return -(std::atan2(accel_scaled.x,
                            std::sqrt(accel_scaled.y * accel_scaled.y + accel_scaled.z * accel_scaled.z)) *
                 180.0) /
               M_PI;
    }

    Scaled MPU6050::get_yaw() const noexcept
    {
        if (!this->initialized_) {
            std::unreachable();
        }

        const auto accel_scaled{get_accelerometer_scaled()};

        return {};
    }

    void MPU6050::set_interrupt() const noexcept
    {
        this->set_interrupt_mode(INTMODE_ACTIVEHIGH);
        // this->set_interrupt_drive(INTDRV_PUSHPULL);
        this->set_interrupt_latch(INTLATCH_50USPULSE);
        this->set_interrupt_latch_clear(INTCLEAR_STATUSREAD);
        this->set_int_enable_register(ENABLE);

        // Enable Motion interrputs
        // this->set_dhpf_mode(DHPF_5);
        // this->set_int_motion_enabled(ENABLE);
        // this->set_int_zero_motion_enabled(1);
        // this->set_int_free_fall_enabled(1);
        // this->set_free_fall_detection_duration(2);
        // this->set_free_fall_detection_threshold(5);
        // this->set_motion_detection_duration(5);
        // this->set_motion_detection_threshold(2);
        // this->set_zero_motion_detection_duration(2);
        // this->set_zero_motion_detection_threshold(4);
    }

    void MPU6050::set_interrupt_mode(IntrMode const mode) const noexcept
    {
        std::uint8_t buffer{(mode & 1U) << INTCFG_INT_LEVEL_BIT};
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_INT_PIN_CFG,
                          sizeof(RA_INT_PIN_CFG),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_interrupt_drive(IntrDrive const drive) const noexcept
    {
        std::uint8_t buffer{(drive & 1U) << INTCFG_INT_OPEN_BIT};
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_INT_PIN_CFG,
                          sizeof(RA_INT_PIN_CFG),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_interrupt_latch(IntrLatch const latch) const noexcept
    {
        std::uint8_t buffer{(latch & 1U) << INTCFG_INT_RD_CLEAR_BIT};
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_INT_PIN_CFG,
                          sizeof(RA_INT_PIN_CFG),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_interrupt_latch_clear(IntrClear const clear) const noexcept
    {
        std::uint8_t buffer{(clear & 1U) << INTCFG_LATCH_INT_EN_BIT};
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_INT_PIN_CFG,
                          sizeof(RA_INT_PIN_CFG),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_int_enable_register(Enable const enable) const noexcept
    {
        std::uint8_t buffer{enable};
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_INT_ENABLE,
                          sizeof(RA_INT_ENABLE),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

